Repository: Daniel-KM/Omeka-S-module-CleanUrl
Catalog: language/*.po
Languages: fr

source: Unable to copy config files "config/clean_url.config.php" and/or "config/clean_url.dynamic.php" in the config directory of Omeka.
fr: Impossible de copier le fichier de configuration "config/clean_url.config.php" ou "config/clean_url.dynamic.php" dans le dossier de configuration d’Omeka.

source: Check the new config file "config/clean_url.config.php" and remove the old one in the config directory of Omeka.
fr: Vérifier le nouveau fichier de configuration "config/clean_url.config.php" et supprimer l’ancien dans le dossier "config" d’Omeka.

source: This module requires the module "%s", version %s or above.
fr: Ce module requiert le module "%s", version "%s" ou supérieur.

source: "Clean Url" module allows to have clean, readable and search engine optimized urls for pages and resources, like https://example.net/item_set_identifier/item_identifier.
fr: Le module "Clean Url" permet de diffuser des urls claires, lisibles, et optimisées pour les moteurs de recherche pour les pages et les ressources, comme http://exemple.com/ma_collection/id_contenu.

source: For identifiers, it is recommended to use a pattern that includes at least one letter to avoid confusion with internal numerical ids.
fr: Pour les identifiants, il est recommandé d’utiliser un modèle qui inclut au moins une lettre pour éviter la confusion avec les numéros internes.

source: For a good seo, it’s not recommended to have multiple urls for the same resource.
fr: Pour un bon SEO, il n’est pas recommandé d’avoir plusieurs urls pour une même ressource.

source: See %s for more information.
fr: Voir %s pour plus d’informations.

source: %sWarning%s: the config of the module cannot be saved in "config/cleanurl.config.php". It is required to skip the site paths.
fr: %sAttention%s: la configuration du module ne peut pas être enregistrée dans "config/cleanurl.config.php". Cela est nécessaire pour ignorer les chemins des sites.

source: [none]
fr: [aucun]

source: This module requires the module "%s".
fr: Ce module requiert le module "%s".

source: This module requires modules "%s".
fr: Ce module requiert les modules "%s".

source: This module has resources that connot be installed.
fr: Ce module a des ressources qui ne peuvent pas être installées.

source: The module "%s" was automatically deactivated because the dependencies are unavailable.
fr: Le module "%s" a été automatiquement désactivé car ses dépendances ne sont plus disponibles.

source: Your previous version is too old to do a direct upgrade to the current version. Upgrade to version 3.15.13 first, or uninstall/reinstall the module.
fr: Votre version est trop ancienne pour permettre une mise à niveau directe vers la nouvelle version. Mettez d’abord à niveau vers la version 3.15.13, ou désinstallez et réinstallez le module.

source: The file "clean_url.config.php" and/or "config/clean_url.dynamic.php" in the config directory of Omeka is not writeable.
fr: Le fichier "clean_url.config.php" ou "config/clean_url.dynamic.php" dans le dossier de configuration d’Omeka ne peut pas être modifié.

source: The file "config/cleanurl.config.php" at the root of Omeka is not writeable.
fr: Le fichier "config/cleanurl.config.php" dans le dossier de configuration d’Omeka n’est pas modifiable.

source: The module has been rewritten and the whole configuration has been simplified. You should check your config, because the upgrade of the configuration is not automatic.
fr: Le module a été entièrement réécrit et l’ensemble de la configuration a été simplifiée. Il est recommandé de vérifier la configuration car la mise à jour n’ est pas automatique.

source: The file "cleanurl.config.php" in the config directory of Omeka is not writeable.
fr: Le fichier "cleanurl.config.php" dans le dossier de configuration d’Omeka n’est pas modifiable.

source: The config of the module cannot be saved in "config/cleanurl.config.php". It is required to skip the site paths.
fr: La configuration du module ne peut pas être enregistrée dans "config/cleanurl.config.php". Cela est nécessaire pour ignorer les chemins des sites.

source: There is no default site: "/s/site-slug" cannot be empty or skipped.
fr: Aucun site par défaut n'est défini : "/s/site-slug" ne peut pas être vide ou enlevé.

source: The sites "%s" use a reserved string and the "/s/site-slug" cannot be skipped.
fr: Les sites "%s" utilisent une chaîne réservée et "/s/site-slug" ne peut pas être enlevé.

source: The site pages "%s" use a reserved string and "/s/site-slug" cannot be skipped.
fr: Les pages de site "%s" utilisent une chaîne réservée et "/s/site-slug" ne peut pas être enlevé.

source: The slug "%s" is used or reserved and the prefix for sites cannot be updated.
fr: Le segment "%s" est utilisé ou réservé et le préfixe pour les sites ne peut pas être mis à jour.

source: The sites "%s" use a reserved string and the prefix for sites cannot be removed.
fr: Les sites "%s" utilisent une chaîne réservée et le préfixe pour les sites ne peut enlevé.

source: The slug "%s" is used or reserved and the prefix for pages cannot be updated.
fr: Le segment "%s" est utilisé ou réservé et le préfixe des pages ne peut pas être modifié.

source: The site pages "%s" use a reserved string and the prefix for pages cannot be removed.
fr: Les pages de site "%s" utilisent une chaîne réservée et le préfixe pour les pages ne peut pas être enlevé.

source: A pattern for "%s", for example "[a-zA-Z0-9_-]+", is required to use the path "%s".
fr: Un modèle pour "%s", par exemple "[a-zA-Z0-9_-]+", est nécessaire pour le chemin "%s".

source: The slug "%s" is used or reserved. A random string has been automatically appended.
fr: Le segment "%s" est utilisé ou réservé. Une chaîne aléatoire a été automatiquement ajoutée.

source: The path "%s" for item sets should contain one and only one item set identifier.
fr: Le chemin "%s" pour les collections doit contenir un identifiant et un seul.

source: The path "%s" for item sets should not contain identifier "%s".
fr: Le chemin "%s" pour les collections ne doit pas contenir l’identifiant "%s".

source: The path "%s" for items should contain one and only one item identifier.
fr: Le chemin "%s" pour les contenus doit contenir un identifiant et un seul.

source: The path "%s" for items should not contain identifier "%s".
fr: Le chemin "%s" pour les contenus ne doit pas contenir l’identifiant "%s".

source: The path "%s" for medias should contain one and only one item identifier.
fr: Le chemin "%s" pour les médias doit contenir un identifiant et un seul.

source: The path "%s" for medias should not contain identifier "%s".
fr: Le chemin "%s" pour les médias ne doit pas contenir l’identifiant "%s".

source: The path "%s" for medias should contain an item identifier.
fr: Le chemin "%s" pour les médias doit contenir un identifiant du contenu.

source: A short pattern for "%s", for example "[a-zA-Z0-9_-]+", is required to use the path "%s".
fr: Un modèle pour "%s", par exemple "[a-zA-Z0-9_-]+", est nécessaire pour le chemin "%s".

source: Sites and pages
fr: Sites et pages

source: Skip "s/site-slug/" for default site
fr: Enlever "s/site-slug/" du site par défaut

source: The main site is defined in the main settings.
fr: Le site principal est défini dans les paramètres généraux.

source: Rename or skip prefix /s/
fr: Renommer ou ignorer le préfixe /s/

source: Rename or skip prefix /page/
fr: Renommer ou ignorer le préfixe /page/

source: Medias
fr: Médias

source: Admin Interface
fr: Interface admin

source: Use in admin board
fr: Utiliser dans l’interface admin

source: Other reserved routes in admin
fr: Autres routes réservées en interface admin

source: This option allows to fix routes for unmanaged modules. Add them in the file cleanurl.config.php or here, one by row.
fr: Cette option permet de corriger les routes pour les modules non gérés. On peut les ajouter dans le fichier "cleanurl.config.php" ou ici, une par ligne.

source: Default path
fr: Chemin par défaut

source: Path with placeholders, without site slug.
fr: Chemin avec des chaînes réservés, non échappé et sans le site.

source: Short path
fr: Chemin court

source: Additional paths
fr: Chemins complémentaires

source: Pattern of identifier
fr: Modèle d’un identifiant

source: Optional pattern for short identifier
fr: Modèle facultatif pour l’identifiant court

source: Property for identifier
fr: Propriété pour l’identifiant

source: Select a property…
fr: Choisir une propriété…

source: Prefix to select an identifier
fr: Préfixe pour trouver l’identifiant

source: This prefix allows to find one identifier when there are multiple values: "ark:", "record:", or "doc =". Include space if needed. Let empty to use the first identifier. If this identifier does not exists, the Omeka resource id will be used.
fr: Ce préfixe permet de trouver un identifiant quand une ressource en a plusieurs : "ark:", "notice:", or "doc =". Inclure l’espace si besoin. Laisser vide pour utiliser le premier identifiant. Si l’identifiant n’existe pas, l’identifiant Omeka sera utilisé.

source: The prefix is part of the identifier
fr: Le préfixe fait partie de l’identifiant

source: Identifiers have slash, so don’t escape it
fr: Les identifiants ont une barre "/" à ne pas échapper

source: Identifiers are case sensitive
fr: Les identifiants sont sensibles à la casse

source: Item should be an Item, an ItemRepresentation or an integer.
fr: L’item doit être un Item, un ItemRepresentation ou un entier.
